import React from 'react';
import { Select } from 'antd';

const { Option } = Select;
export const Code = [
  ['0008', '蓝牙断开'],
  ['000A', '自动迎宾'],
  ['000B', '离车自动上锁'],
  ['000C', '近车自动解锁'],
  ['000D', '通过蓝牙数字钥匙一键启动'],
  ['0003', '把手按钮上锁'],
  ['0004', '把手按钮解锁'],
  ['0005', '引擎停止'],
  ['0006', '引擎启动'],
  ['0009', '按钮触发开启后备箱'],
  ['000E', '手机在车内车辆上锁手动关闭后备箱后自动弹开'],
  ['000F', '脚踢开启尾门'],
  ['0010', '手机在车内关闭最后一扇门提醒'],
  ['0011', '手机在车内上锁后关闭车门车辆自动解锁'],
  ['0012', '多蓝牙唤醒次数超限'],
  ['0014', '车辆未熄火'],
  ['0015', '车辆未闭锁'],
  ['0016', '车辆未下电'],
];
export const keyStatusCode = [
  <Option key={0}>钥匙激活</Option>,
  <Option key={1}>钥匙开通</Option>,
  <Option key={2}>分享钥匙</Option>,
];
