import React from 'react';
import { Select } from 'antd';

const { Option } = Select;
export const Code = [
  ['08', '蓝牙断开'],
  ['0A', '自动迎宾'],
  ['0B', '离车自动上锁'],
  ['0C', '近车自动解锁'],
  ['0D', '通过蓝牙数字钥匙一键启动'],
  ['03', '把手按钮上锁'],
  ['04', '把手按钮解锁'],
  ['05', '引擎停止'],
  ['06', '引擎启动'],
  ['09', '按钮触发开启后备箱'],
  ['0E', '手机在车内车辆上锁手动关闭后备箱后自动弹开'],
  ['0F', '脚踢开启尾门'],
  ['10', '手机在车内关闭最后一扇门提醒'],
  ['11', '手机在车内上锁后关闭车门车辆自动解锁'],
  ['12', '多蓝牙唤醒次数超限'],
  ['14', '车辆未熄火'],
  ['15', '车辆未闭锁'],
  ['16', '车辆未下电'],
];
export const keyStatusCode = [
  <Option key={0}>钥匙激活</Option>,
  <Option key={1}>钥匙开通</Option>,
  <Option key={2}>分享钥匙</Option>,
];
